tap "homebrew/bundle"
brew "bat"
brew "chafa"
brew "chezmoi"
brew "cpanminus"
brew "duf"
brew "dust"
brew "fcp"
brew "fd"
brew "ffmpegthumbnailer"
brew "fzf"
brew "gh"
brew "imagemagick"
brew "jq"
brew "lsd"
brew "mas"
brew "perl"
brew "poppler"
brew "procs"
brew "ripgrep"
brew "sevenzip"
brew "sheldon"
brew "starship"
brew "tree"
brew "yazi"
brew "zoxide"
cask "1password"
cask "arc"
cask "bettertouchtool"
cask "brave-browser"
cask "chatgpt"
cask "docker"
cask "font-hack-nerd-font"
cask "font-symbols-only-nerd-font"
cask "hhkb"
cask "karabiner-elements"
cask "mactex-no-gui"
cask "mathpix-snipping-tool"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-teams"
cask "monitorcontrol"
cask "obsidian"
cask "raycast"
cask "stats"
cask "visual-studio-code"
cask "vmware-horizon-client"
cask "warp"
cask "wezterm"
cask "zoom"
cask "zotero"
mas "iMovie", id: 408981434
mas "Microsoft To Do", id: 1274495053
mas "Xcode", id: 497799835
vscode "076923.python-image-preview"
vscode "aaron-bond.better-comments"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "eamodio.gitlens"
vscode "elazarcoh.simply-view-image-for-python-debugging"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "hediet.debug-visualizer"
vscode "hediet.vscode-drawio"
vscode "james-yu.latex-workshop"
vscode "johnpapa.vscode-peacock"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "mxschmitt.postscript"
vscode "natqe.reload"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "redhat.vscode-yaml"
vscode "sleistner.vscode-fileutils"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "yy0931.mplstyle"
vscode "yzhang.markdown-all-in-one"
vscode "zhikui.vscode-openfoam"
